---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsAttrCalcMax
source: html/1817747b-6088-ae44-5cd3-3fe7c75fde5b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsAttrCalcMax Property

"Calculation Rules"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsAttrCalcMax { get; }
```